---
kind: property
id: P:Autodesk.Revit.DB.PolymeshTopology.NumberOfPoints
source: html/0241ca22-169b-ce90-ec5b-c9688990ff73.htm
---
# Autodesk.Revit.DB.PolymeshTopology.NumberOfPoints Property

The number of points in the polymesh

## Syntax (C#)
```csharp
public int NumberOfPoints { get; }
```